#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_ABP_mclaren_650s_gt3_driver_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_mclaren_650s_gt3_driver.ABP_mclaren_650s_gt3_driver_C
// 0x32D8 (0x3728 - 0x0450)
class UABP_mclaren_650s_gt3_driver_C : public UAcDriverAnimations
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0450(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_01EB10F9477C9A82D65036863767617E;      // 0x0458(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1F699AB4FD972AB5B776DB9C71ECA58;// 0x04A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_051F171049AFA3F3480871B5DDB5401C;// 0x04E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A78A5AC34B9288CE38F2F49B7EE6EA9E;// 0x0530(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C4364E74823AF5972C50A86ED6507DE;// 0x0578(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C1BBA914C7A4694DF70A49096062BC2;// 0x05C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_99ED82684DB7734DC5FD3D8A0DED0243;// 0x0608(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F5965D0D4F9B97593A5D9A89DE390D55;// 0x06B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_70C83596468DC3788E24A3AA09992AB7;// 0x0700(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6F276FEB4A79D1FCBAE27FB83B393010;// 0x07B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_757B9B314225B2FAD22617B8478A36E6;// 0x07F8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3EAE885244A8507FAD296996760B870A;// 0x08A8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DA485570414CAF33EA972582F464B499;// 0x08F0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE61CC66480F7D3C2110F68B746AB14D;// 0x0A08(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_EE0AE1D84FE4444CCE5CB5B6F75E0A76;// 0x0AB8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8E1474544DAA9FD717B2169D0E067CB1;// 0x0BD0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0EDF3A4D437F515525B195AD121FD0B8;// 0x0C80(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C5733C246AF926E10B67E9B17E2AE54;// 0x0D98(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AF55406442EB5B0E8517EE84963E7F32;// 0x0E48(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D3BD32384F4019ADF740A9ABC660C5FB;// 0x0F60(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_87F307D34D8E8B2A73CC488D42CD4720;// 0x1010(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_98487F8D401AAB55984FE39EE06AFF3F;// 0x1128(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_257DF0904A20E6448FA4668A38A6520B;// 0x1240(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B0039B6D47E2B2AB337311A7C4F6562C;// 0x12F0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_ECBB4002432B3853CDCD1AB6BE2CB066;// 0x13A0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C5E37F324A86B864CA051FA5BF341C63;// 0x14B8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DF9384C049D7C4848A5C498F6B480393;// 0x15D0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9A1FB2CC40CE1010807879ABF78BDB30;// 0x16E8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A1BADD804394F8D24B8DE99C6330F931;// 0x1800(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3BD62D404365D2D6B0A8CA8675AB1AAD;// 0x1918(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3B39090945DE85ED421234A8D6E2DF5C;// 0x1A30(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_33AC39524457730FF625F2A97038543D;// 0x1B48(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D4151FB94BA8570227D7CF9B5D5513C3;// 0x1C60(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_EE71794A4BBAAB1C2CF686A33EB696AC;// 0x1D78(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_688324994933E8B176CF6686BC8F44BB;// 0x1E90(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_504288E74A2F1968D8D6B5BB0E194EC9;// 0x1FA8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03E35576416D897E9CDD31B48E81B2EB;// 0x2058(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_977CE15B4DE547DDC63807BD570BE01C;// 0x2108(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0C70D5B24C65A762881AD08A74D28502;// 0x21B8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E3BC72043F1F0AC9D60C5AC91091135;// 0x2268(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_623409B44435981BA17627AE5ECBBD10;// 0x2318(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A8A96924DB2BA797127B79596B41F9A;// 0x23C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD59574B4FE1227B3C4B9F9C54D4594A;// 0x2478(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4EE5596E4A40AD959AC35DB13FF1A2FF;// 0x2528(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00A4A65540CC80D3F01CD6A7933B64AA;// 0x25D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67F707CD4B9C449A0A226396990B6881;// 0x2688(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_20E2D5144C7643849B2387A079A4607E;// 0x2738(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7C1F5AA14014B062E7438092937EB7BA;// 0x2860(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_667C758C484F88232110DBA3D78FFDA1;// 0x2988(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_60A911554DDE5305EA442A9813B88256;// 0x2AA0(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_918DB96E433CC10237739F823E6E2E67;// 0x2BB8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1D64E72E4334E252D533D3830A145520;// 0x2CE0(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_53C46E2A423C384D701607B17224B1FF;// 0x2E08(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AFD3D9314230DBC3D967C1AFDA9E7ED2;// 0x2F20(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AE6523D1464110F3AE0D3B88963D7645;// 0x3038(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_54FD8647432189E6F0201A9323D81B40;// 0x3150(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4892FEA84913171AA2A7A2810F8C83B6;// 0x3268(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FBE644EA4C816E7AA81FD6A4372A0DA2;// 0x3318(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_0BCFBE94459D466604D9EC81103819A3;// 0x33C8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF0C78F04EF5F03DC7FE91A8D19733FD;// 0x3438(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BDF475BA4BCBBCD40E77CAA4D9FAF2D6;// 0x34E8(0x0118)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_64F92862442BD1FB78AA248269F7FB8F;// 0x3600(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AAC9287F4931EF9C56418CBCE7024051;// 0x3648(0x00E0)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_mclaren_650s_gt3_driver.ABP_mclaren_650s_gt3_driver_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_9A1FB2CC40CE1010807879ABF78BDB30();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_A1BADD804394F8D24B8DE99C6330F931();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_3BD62D404365D2D6B0A8CA8675AB1AAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_3B39090945DE85ED421234A8D6E2DF5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_33AC39524457730FF625F2A97038543D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_D4151FB94BA8570227D7CF9B5D5513C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_EE71794A4BBAAB1C2CF686A33EB696AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_688324994933E8B176CF6686BC8F44BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_504288E74A2F1968D8D6B5BB0E194EC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_03E35576416D897E9CDD31B48E81B2EB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_977CE15B4DE547DDC63807BD570BE01C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_0C70D5B24C65A762881AD08A74D28502();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_3E3BC72043F1F0AC9D60C5AC91091135();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_623409B44435981BA17627AE5ECBBD10();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_2A8A96924DB2BA797127B79596B41F9A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_BD59574B4FE1227B3C4B9F9C54D4594A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_4EE5596E4A40AD959AC35DB13FF1A2FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_00A4A65540CC80D3F01CD6A7933B64AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_67F707CD4B9C449A0A226396990B6881();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_BlendSpacePlayer_20E2D5144C7643849B2387A079A4607E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_BlendSpacePlayer_7C1F5AA14014B062E7438092937EB7BA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_BlendSpacePlayer_918DB96E433CC10237739F823E6E2E67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_BlendSpacePlayer_1D64E72E4334E252D533D3830A145520();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_AE6523D1464110F3AE0D3B88963D7645();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_54FD8647432189E6F0201A9323D81B40();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_4892FEA84913171AA2A7A2810F8C83B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_FBE644EA4C816E7AA81FD6A4372A0DA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequenceEvaluator_0BCFBE94459D466604D9EC81103819A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_257DF0904A20E6448FA4668A38A6520B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_DF9384C049D7C4848A5C498F6B480393();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_98487F8D401AAB55984FE39EE06AFF3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_87F307D34D8E8B2A73CC488D42CD4720();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_D3BD32384F4019ADF740A9ABC660C5FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_C5E37F324A86B864CA051FA5BF341C63();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_AF55406442EB5B0E8517EE84963E7F32();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_8C5733C246AF926E10B67E9B17E2AE54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_0EDF3A4D437F515525B195AD121FD0B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_8E1474544DAA9FD717B2169D0E067CB1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_EE0AE1D84FE4444CCE5CB5B6F75E0A76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_EE61CC66480F7D3C2110F68B746AB14D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_DA485570414CAF33EA972582F464B499();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_TransitionResult_7C1BBA914C7A4694DF70A49096062BC2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_TransitionResult_3C4364E74823AF5972C50A86ED6507DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_ApplyAdditive_ECBB4002432B3853CDCD1AB6BE2CB066();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_TransitionResult_A78A5AC34B9288CE38F2F49B7EE6EA9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_TransitionResult_051F171049AFA3F3480871B5DDB5401C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_TransitionResult_C1F699AB4FD972AB5B776DB9C71ECA58();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mclaren_650s_gt3_driver_AnimGraphNode_SequencePlayer_B0039B6D47E2B2AB337311A7C4F6562C();
	void ExecuteUbergraph_ABP_mclaren_650s_gt3_driver(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
