#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_ABP_porsche_991ii_gt3_cup_driver_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_porsche_991ii_gt3_cup_driver.ABP_porsche_991ii_gt3_cup_driver_C
// 0x2D80 (0x31D0 - 0x0450)
class UABP_porsche_991ii_gt3_cup_driver_C : public UAcDriverAnimations
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0450(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_5D6800A643A127206DEDEC840F31E7BB;      // 0x0458(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0AC5F1EA4474CBCC51F098843A073924;// 0x04A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D04A84F94E2D499BF9CF3D8200701A53;// 0x04E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CBA049694FC09B8DE023FCBAAD47CAA8;// 0x0530(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE3F239E406F2AE71702278648544DB1;// 0x0578(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F476F294A5A06C9E4BD0DB5A459C30C;// 0x05C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F865C914370BB78ACF240854BB6BD15;// 0x0608(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_05F7463A40D2D535C53B9B964E69F15C;// 0x06B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB36938E4C3BD08CA49C2CB8B8BB77FE;// 0x0700(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_154BCBC94581F52C33C60F9EE7712D1A;// 0x07B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDBB4BB74E7185ED880FC690BACB4D40;// 0x07F8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FD9D9A2C475400D7D31B06B8ED9017D2;// 0x08A8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BF2D110B4FD991AA54632380F087C1EE;// 0x08F0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_221C26004DDF9DC49D20F297C07337A8;// 0x0A08(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4BE146B04C71A18EC715E780FB33AB79;// 0x0B20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3484B0AD482EA8BD027697AEBDD4CA84;// 0x0BD0(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B339E3834C3833E6D8A8E3800C272426;// 0x0C80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BCA46B44476A30C4F483AFA4643907DE;// 0x0CF0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_23FECA884D02F441C53A8D9B013A98A0;// 0x0DA0(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_578FD7924009A8ED9A7251B9C4CA998F;// 0x0EB8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D60336514B8D33944A8D14A3C52862CF;// 0x0FE0(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_730627CE405975C57D52FE913F1836E1;// 0x1108(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1B9AB00E41FB080BAE4242BFDCE27E14;// 0x1220(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A382AC664951E975D3CF53BD2BD77965;// 0x1338(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_ACEDF1D4485E05ED1FD64EA6F9F0D81F;// 0x1460(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8E3E081749B689955A78F5B1B27BA5DE;// 0x1588(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C6869993415AC1A2779FEFAF4D8BDACB;// 0x16A0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3E7D164C42F4308B05A0B0B93FC1A0E9;// 0x17B8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A2D8A88446301C623940BCA6731E53C7;// 0x18D0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9C31ADBF4D16DC67EC8E88BC0C08CC0C;// 0x19E8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B6DDF39841775F81453032AB0D9BEFA6;// 0x1B00(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AAD9F5DA4F78266BD0A5CB8D781448F8;// 0x1C18(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C2053DD8407221197A8A95B5EA54829A;// 0x1D30(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_704281E6475B7A265F726597C5AA89B0;// 0x1E48(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_EDBD45594C02673FDD509C86A16C9574;// 0x1F60(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D386D6A340FAA3287D545CA7329924DB;// 0x2078(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_904B843C4ABADC1A018845B63D06D074;// 0x2190(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E67E141C4B228F7C977178BB46521883;// 0x22A8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6CFB8B6045370AA018F60DB1F7314CF4;// 0x23C0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CB2A2B0542796A5C35F4AA92F4A9DE31;// 0x24D8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0CE20D054777FBD4C86042836FD4D558;// 0x25F0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_455F7E774532D584BD9B4CB03AF30843;// 0x2708(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A3B7730141189C79588120AA7FFDF2A3;// 0x27B8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2EA507DC41FA40B4B3D9BFADEDF9B900;// 0x2868(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4E5F4F84776F9250726EC8772F180A8;// 0x2918(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_840F878441C94CD8883BB3AC4289DF9A;// 0x29C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC6FE4934058BDBDEB51D696F837D24D;// 0x2A78(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_215D50C046BA11918E4754B8983F8D2F;// 0x2B28(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D78AF8E44230AC0E97A3F18A068107B9;// 0x2BD8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_217FDFA1469487E76F0E51AB8D890E26;// 0x2C88(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54868A564C19B8BB4D6B20BD23ED8C59;// 0x2D38(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4DFD88654262F6869F6DF4AD6FBC89E6;// 0x2DE8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0001051048789C74C389D7A3E8114D56;// 0x2E98(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF8EB9B547C681DE8D672889FD5E59E8;// 0x2F48(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F9D9E66B48B3373B52E6D1B19ED114C4;// 0x2FF8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AE941CF342B0FA49DA6CD09E3DB26011;// 0x30A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_54D0E99540B228035B1DE4AE36DAC533;// 0x30F0(0x00E0)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_porsche_991ii_gt3_cup_driver.ABP_porsche_991ii_gt3_cup_driver_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_B6DDF39841775F81453032AB0D9BEFA6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_AAD9F5DA4F78266BD0A5CB8D781448F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_C2053DD8407221197A8A95B5EA54829A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_704281E6475B7A265F726597C5AA89B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_EDBD45594C02673FDD509C86A16C9574();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_D386D6A340FAA3287D545CA7329924DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_904B843C4ABADC1A018845B63D06D074();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_E67E141C4B228F7C977178BB46521883();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_6CFB8B6045370AA018F60DB1F7314CF4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_CB2A2B0542796A5C35F4AA92F4A9DE31();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_0CE20D054777FBD4C86042836FD4D558();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_455F7E774532D584BD9B4CB03AF30843();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_A3B7730141189C79588120AA7FFDF2A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_2EA507DC41FA40B4B3D9BFADEDF9B900();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_B4E5F4F84776F9250726EC8772F180A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_840F878441C94CD8883BB3AC4289DF9A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_CC6FE4934058BDBDEB51D696F837D24D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_215D50C046BA11918E4754B8983F8D2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_D78AF8E44230AC0E97A3F18A068107B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_217FDFA1469487E76F0E51AB8D890E26();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_54868A564C19B8BB4D6B20BD23ED8C59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_4DFD88654262F6869F6DF4AD6FBC89E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_0001051048789C74C389D7A3E8114D56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_EF8EB9B547C681DE8D672889FD5E59E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_F9D9E66B48B3373B52E6D1B19ED114C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_BlendSpacePlayer_A382AC664951E975D3CF53BD2BD77965();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_BlendSpacePlayer_D60336514B8D33944A8D14A3C52862CF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_BlendSpacePlayer_578FD7924009A8ED9A7251B9C4CA998F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequenceEvaluator_B339E3834C3833E6D8A8E3800C272426();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_9C31ADBF4D16DC67EC8E88BC0C08CC0C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_3484B0AD482EA8BD027697AEBDD4CA84();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_SequencePlayer_4BE146B04C71A18EC715E780FB33AB79();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_221C26004DDF9DC49D20F297C07337A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_BF2D110B4FD991AA54632380F087C1EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_TransitionResult_7F476F294A5A06C9E4BD0DB5A459C30C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_TransitionResult_AE3F239E406F2AE71702278648544DB1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_A2D8A88446301C623940BCA6731E53C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_TransitionResult_CBA049694FC09B8DE023FCBAAD47CAA8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_TransitionResult_D04A84F94E2D499BF9CF3D8200701A53();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_ApplyAdditive_3E7D164C42F4308B05A0B0B93FC1A0E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_TransitionResult_0AC5F1EA4474CBCC51F098843A073924();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver_AnimGraphNode_BlendSpacePlayer_ACEDF1D4485E05ED1FD64EA6F9F0D81F();
	void ExecuteUbergraph_ABP_porsche_991ii_gt3_cup_driver(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
