#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_ABP_nissan_gtr_gt3_2018_driver_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_nissan_gtr_gt3_2018_driver.ABP_nissan_gtr_gt3_2018_driver_C
// 0x34A0 (0x38F0 - 0x0450)
class UABP_nissan_gtr_gt3_2018_driver_C : public UAcDriverAnimations
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0450(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_97E012E34463E7765114D9AD4760381C;      // 0x0458(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C38FD3C4A0FB27253B048AEBF18BF80;// 0x04A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C1F44DD4864AEF7617CC39610599518;// 0x04E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FD9B3DC4C100545B893C89AA5C428A4;// 0x0530(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_920AC4F143BEA660A3DF13909BC7942D;// 0x0578(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32D65CF84A2CD30585050FA794F7481F;// 0x05C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1E8E76F04426D89B1D6D3BA0BCA98BF8;// 0x0608(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ADEAE0C4479757584526D0AFCFBAABC6;// 0x06B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AA5A90D949CB58AFC82AC6B91179B3A8;// 0x0700(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3DBEDDC24B50B657A4F60280846C7E8A;// 0x07B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC62907E4B397829FD6FF9BBA80466BB;// 0x07F8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_31750F7C44F448604A1869B5F341487A;// 0x08A8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F86BDFA34D477AD2A9C08097E07D9FBF;// 0x08F0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9214DE6A4F273458F62F37982B852ECD;// 0x0A08(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ED19DA704ABBF81564B447946DC80F54;// 0x0AB8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88E8C7EE4B7D5A86A6F545B567026969;// 0x0B68(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1F3E2EE84B6EB620915BD6A433F3C275;// 0x0C18(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_65D02A894C63F29C31C0A1A7584641A9;// 0x0D30(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F9A13AB24B9AD49D84A1B2858D6D14E6;// 0x0E48(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CE55221B428154407C1E60939EBEADA6;// 0x0F70(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DE55C020421EAA3D8C76189DD7D2FE3E;// 0x1098(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C63EA6C144AEB30C5919D99101997178;// 0x11B0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_627F951B42BED7959118158AA53E207E;// 0x12C8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C2B4CB744995E33F0E9D22A992732A96;// 0x1378(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F6B3625F4A840DC71AB59F974FEC00AA;// 0x1490(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25DD513046CBC0C3D60B7BAE2C06373D;// 0x15A8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A54EFF934EF5DF9591AB1B8F2FB7AF79;// 0x1658(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FCD835EB4C1CF5AF3268D4921F6A2461;// 0x1770(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2061E1684031802C822A8389E04934B2;// 0x1820(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_51B025D94ABE816DB8FC37A2D4408093;// 0x1938(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2DC9CBF415281595AAEFB8FBF730169;// 0x1A50(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20A7E0B94A18DB90FEB1979CF3B70434;// 0x1B00(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_68A58BE144E284F216DB80B690E6A3FA;// 0x1BB0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_725E89BF469732C818F07AB4FD7741D1;// 0x1CC8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AA924AD2498EA2FADF3D06B2362A087D;// 0x1DE0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_31B59B73447900609DC77CA8C8FBF7A4;// 0x1EF8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8657935E4584DF362AF70BA48141071B;// 0x2010(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_24E8135D4C9EC1D247E474844761071F;// 0x2128(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_32413E43471C7F5166580488617045A3;// 0x2240(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_EB32CD3D4D1EEF70452B7B802C705966;// 0x2358(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3B06C06241FB1046643668B2E9582F7C;// 0x2470(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_EA014B604584D2AA6D0C0FAAB5C44AD8;// 0x2588(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_543ADF384433CE5B744F2897C7ECB085;// 0x26A0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_263B10BC498C0D43BD0869BAAE42DB2C;// 0x2750(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6B52234441C3386C91AD496382A0917;// 0x2800(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45588F9E44FE8C1417B7CB8EAA33F90D;// 0x28B0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8D58E1BB4F616F61C7BF97A34578B8F8;// 0x2960(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A0B5D199450465081301BA9028472A44;// 0x2A10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26E1C9B740C348F08F2E50B7939007A1;// 0x2AC0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9674D91544EBD886D1C58BB3DE1E9F9D;// 0x2B70(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_174DAA6A488F56D556EB55B690F9F5D6;// 0x2C20(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B48160F44C27FD87F38DAE9ED0253CEA;// 0x2CD0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D22103B5481BB62807EC598321906628;// 0x2D80(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CF42FC034F9AF65F284281BE136FF91E;// 0x2EA8(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_567E68CD4D78F1615A576FA3529C40B9;// 0x2FD0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D0F921174C131973DCD3DAAB711F695A;// 0x30E8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7AB1CA0C41A9EF9CB469268EA45622C9;// 0x3200(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DCCEF4E943EA3A908999BEAB5B827BE3;// 0x3318(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_735B5DC74635F3DE823F4499294639B3;// 0x3430(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F6B81F546A1120E528DCB982CB42EAD;// 0x34E0(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1D3A14F043A7FAF562D5C8A3158C8C13;// 0x3590(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9DC000D642FB702231F3019A25190844;// 0x3600(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2D530FFC4F7A87DBD0585591EBD8750E;// 0x36B0(0x0118)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AB39787E46DC9958109389A363FC2DDC;// 0x37C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_08A43C024B4C1CFC259697BDA07C0D24;// 0x3810(0x00E0)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_nissan_gtr_gt3_2018_driver.ABP_nissan_gtr_gt3_2018_driver_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_D2DC9CBF415281595AAEFB8FBF730169();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_20A7E0B94A18DB90FEB1979CF3B70434();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_68A58BE144E284F216DB80B690E6A3FA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_725E89BF469732C818F07AB4FD7741D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_AA924AD2498EA2FADF3D06B2362A087D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_31B59B73447900609DC77CA8C8FBF7A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_8657935E4584DF362AF70BA48141071B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_24E8135D4C9EC1D247E474844761071F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_32413E43471C7F5166580488617045A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_EB32CD3D4D1EEF70452B7B802C705966();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_3B06C06241FB1046643668B2E9582F7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_EA014B604584D2AA6D0C0FAAB5C44AD8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_543ADF384433CE5B744F2897C7ECB085();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_263B10BC498C0D43BD0869BAAE42DB2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_E6B52234441C3386C91AD496382A0917();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_45588F9E44FE8C1417B7CB8EAA33F90D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_8D58E1BB4F616F61C7BF97A34578B8F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_A0B5D199450465081301BA9028472A44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_26E1C9B740C348F08F2E50B7939007A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_9674D91544EBD886D1C58BB3DE1E9F9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_174DAA6A488F56D556EB55B690F9F5D6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_B48160F44C27FD87F38DAE9ED0253CEA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_BlendSpacePlayer_D22103B5481BB62807EC598321906628();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_BlendSpacePlayer_CF42FC034F9AF65F284281BE136FF91E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_7AB1CA0C41A9EF9CB469268EA45622C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_DCCEF4E943EA3A908999BEAB5B827BE3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_735B5DC74635F3DE823F4499294639B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_8F6B81F546A1120E528DCB982CB42EAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequenceEvaluator_1D3A14F043A7FAF562D5C8A3158C8C13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_25DD513046CBC0C3D60B7BAE2C06373D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_51B025D94ABE816DB8FC37A2D4408093();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_F6B3625F4A840DC71AB59F974FEC00AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_C2B4CB744995E33F0E9D22A992732A96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_627F951B42BED7959118158AA53E207E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_2061E1684031802C822A8389E04934B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_BlendSpacePlayer_CE55221B428154407C1E60939EBEADA6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_BlendSpacePlayer_F9A13AB24B9AD49D84A1B2858D6D14E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_65D02A894C63F29C31C0A1A7584641A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_1F3E2EE84B6EB620915BD6A433F3C275();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_88E8C7EE4B7D5A86A6F545B567026969();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_ED19DA704ABBF81564B447946DC80F54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_9214DE6A4F273458F62F37982B852ECD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_F86BDFA34D477AD2A9C08097E07D9FBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_TransitionResult_32D65CF84A2CD30585050FA794F7481F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_TransitionResult_920AC4F143BEA660A3DF13909BC7942D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_SequencePlayer_FCD835EB4C1CF5AF3268D4921F6A2461();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_TransitionResult_3FD9B3DC4C100545B893C89AA5C428A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_TransitionResult_0C1F44DD4864AEF7617CC39610599518();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_TransitionResult_2C38FD3C4A0FB27253B048AEBF18BF80();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver_AnimGraphNode_ApplyAdditive_A54EFF934EF5DF9591AB1B8F2FB7AF79();
	void ExecuteUbergraph_ABP_nissan_gtr_gt3_2018_driver(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
