#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_ABP_audi_r8_lms_driver_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_audi_r8_lms_driver.ABP_audi_r8_lms_driver_C
// 0x33B8 (0x3808 - 0x0450)
class UABP_audi_r8_lms_driver_C : public UAcDriverAnimations
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0450(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_CA80DF1E423F6AD6C11A93A4D5806E2F;      // 0x0458(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4625D70149350F7CF0A87283EDC60FEC;// 0x04A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7132A75F4C69C9D8CF77F2B7EB483F2B;// 0x04E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3EE6C7D49A0FF8421097E88EC831D12;// 0x0530(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80574D4144690D120062CC88CADC062F;// 0x0578(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_107914334FFACF4709D77C874B9F6971;// 0x05C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6ACAF454F0D0663EA2862907EA5AD12;// 0x0608(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E928CAB74CFB1A29685BB69EAFC7CCB6;// 0x0650(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FBB1C6C4858FBF706D121B27E2EF7E7;// 0x0698(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7BB7EC4D4C0DEAFCF25863A796036F27;// 0x06E0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_78322CF74249E99CC3D4CF9C554D94C1;// 0x0790(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67FE49B74B183E1BC787F9A62764AFB8;// 0x07D8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F7CEDB64B7A7B0B3A08CB87A3648F00;// 0x0888(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D1567994616084A46A0EC8482C01C1A;// 0x08D0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_205FEC914853AEBBDC2A488702E786DC;// 0x0980(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22A828CD4B026CB91C1640B4548CA048;// 0x09C8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A350099E41CF12A47A68739922547847;// 0x0A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E3323E3445CF67AE8D6FF94F83E2800;// 0x0AC0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_58EFC1A645C506A6806260A99CF9FF41;// 0x0B70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_143B8F474D096656ED7047BDD86E24A4;// 0x0BB8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AD67B36741F083AB4657A8B43F23C217;// 0x0C68(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C260492044918B293D1F89B951FABEF8;// 0x0D80(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ACBAA84840FE3894E9088F91F680F79F;// 0x0E98(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A1114114CD910FF4B097BBB4D891841;// 0x0F48(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_375E0D754097FA4E39974A845F41C7BF;// 0x0FF8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C81F73CE48CC655A5F04F387CDF26518;// 0x1110(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A9B4B91433CCDD227CD35B49D04513F;// 0x11C0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0137C047466400FB32DB93BE071E1004;// 0x1270(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C415CF6641B7AADAE89F79B711EADF4F;// 0x1388(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_83C47ACF4D484D68DA5EB8A50AE5E85F;// 0x14A0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3792B1694F94F7E82B2BD788270B530F;// 0x15B8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C212F69B40267AFAFE2376ABC431958A;// 0x1668(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4C9005674BE29BC54D6D569084A67B18;// 0x1718(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3A5B5ED844CC5D2D3A2B9D8CF09E9125;// 0x1830(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_16A7BC3D4BD71EC3FB54969656B44D84;// 0x1948(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D27EC60F45153B303A2FC8BD4CCBE214;// 0x1A60(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AC8CBE054D6A5F5C74B38890A1DD280D;// 0x1B78(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55EF5D724DFBF3DEFAD80E940FF1CC8E;// 0x1C90(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_49C9A65A4BB82BA1F5CE3EB80E19BB65;// 0x1D40(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23E4D65142948AF677BA22A6A2CFDEE9;// 0x1DF0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BF98E8AE4AD0F46876F9B490F83CA85D;// 0x1EA0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E42DB3C1442402E193CE788D6A7D6AEF;// 0x1F50(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_57923D204E8789181B7411876684E3AE;// 0x2078(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5314010341BBEED5F400BEA9C6E27537;// 0x21A0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D1EECFD144C52CE2DCA26DA421181595;// 0x2250(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C3A1F0EA4ECCB880637BD8BAC96D13DD;// 0x2368(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_61C2192D42055CAC3038F5B58F7E43C6;// 0x2418(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD82F29A4AD087610916ADA8D193CD06;// 0x24C8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3FE9BE86470AFF28E246DAB6FB963C2B;// 0x2578(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A94C98E44B660DF2F5928BA7D3547D1;// 0x2628(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DDC79D454A0D39AFC7618280DAA169B9;// 0x26D8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9AA0F38A42F613F5EFB1B3A112D8A927;// 0x2788(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D1E1858A46884BA7A49F1497E47730E3;// 0x28A0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B09196CA4E61FD67B335E684D0C1E298;// 0x29B8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7BFE857541450CB3BE0E13B2D75F55FE;// 0x2AD0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_85663F634EA0B37BE12A718170AEDA54;// 0x2BE8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00A529494B6E5C655D62089FB4C7C050;// 0x2D00(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_31610B5040E2EFF513EB6B809E014E97;// 0x2DB0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E38E79240EEA07A30F82485461B2572;// 0x2EC8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A1A11E4A42FD4B277E4813A079EAA32C;// 0x2F78(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_6C9A0BE843DD4FE22912B3AC906A568A;// 0x3090(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_86AF84AB43407BC55E48918F7AA0DB22;// 0x3100(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_908C38B04CBE550C56EC33986E127937;// 0x3218(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D19D26374C35AEA51F48358D12CC2928;// 0x3330(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3F2C29C244DCAD085C93AE895E9CDE9E;// 0x3448(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_56512EB2429BF81D199A1A93B11E2643;// 0x3570(0x0118)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_27CB1BCF42D1C1374FDE81A0321EC038;// 0x3688(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A56F0DD04C6DA2683DBAA0A5A3A97210;// 0x36D0(0x00E0)
	class ACarAvatar*                                  CarAvatar;                                                // 0x37B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	bool                                               Is_on_CAR_marker;                                         // 0x37B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x37B9(0x0003) MISSED OFFSET
	float                                              Belt_ON_time;                                             // 0x37BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Belt_OFF_time;                                            // 0x37C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Is_Driving;                                               // 0x37C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SkipAnimations;                                           // 0x37C5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x37C6(0x0002) MISSED OFFSET
	struct FScriptMulticastDelegate                    NetOff;                                                   // 0x37C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    NetOn;                                                    // 0x37D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    DoorOpen;                                                 // 0x37E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    DoorClose;                                                // 0x37F8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_audi_r8_lms_driver.ABP_audi_r8_lms_driver_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_ACBAA84840FE3894E9088F91F680F79F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_8A1114114CD910FF4B097BBB4D891841();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_375E0D754097FA4E39974A845F41C7BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_C81F73CE48CC655A5F04F387CDF26518();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_8A9B4B91433CCDD227CD35B49D04513F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_0137C047466400FB32DB93BE071E1004();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_C415CF6641B7AADAE89F79B711EADF4F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_83C47ACF4D484D68DA5EB8A50AE5E85F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_3792B1694F94F7E82B2BD788270B530F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_C212F69B40267AFAFE2376ABC431958A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_4C9005674BE29BC54D6D569084A67B18();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_3A5B5ED844CC5D2D3A2B9D8CF09E9125();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_16A7BC3D4BD71EC3FB54969656B44D84();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_D27EC60F45153B303A2FC8BD4CCBE214();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_AC8CBE054D6A5F5C74B38890A1DD280D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_55EF5D724DFBF3DEFAD80E940FF1CC8E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_49C9A65A4BB82BA1F5CE3EB80E19BB65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_23E4D65142948AF677BA22A6A2CFDEE9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_BF98E8AE4AD0F46876F9B490F83CA85D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_BlendSpacePlayer_E42DB3C1442402E193CE788D6A7D6AEF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_BlendSpacePlayer_57923D204E8789181B7411876684E3AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_D1EECFD144C52CE2DCA26DA421181595();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_C3A1F0EA4ECCB880637BD8BAC96D13DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_61C2192D42055CAC3038F5B58F7E43C6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_AD82F29A4AD087610916ADA8D193CD06();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_3FE9BE86470AFF28E246DAB6FB963C2B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_2A94C98E44B660DF2F5928BA7D3547D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_DDC79D454A0D39AFC7618280DAA169B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_9AA0F38A42F613F5EFB1B3A112D8A927();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_D1E1858A46884BA7A49F1497E47730E3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_B09196CA4E61FD67B335E684D0C1E298();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_7BFE857541450CB3BE0E13B2D75F55FE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_85663F634EA0B37BE12A718170AEDA54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_00A529494B6E5C655D62089FB4C7C050();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_31610B5040E2EFF513EB6B809E014E97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_2E38E79240EEA07A30F82485461B2572();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_A1A11E4A42FD4B277E4813A079EAA32C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequenceEvaluator_6C9A0BE843DD4FE22912B3AC906A568A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_BlendSpacePlayer_3F2C29C244DCAD085C93AE895E9CDE9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_1D1567994616084A46A0EC8482C01C1A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_67FE49B74B183E1BC787F9A62764AFB8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_C260492044918B293D1F89B951FABEF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_1FBB1C6C4858FBF706D121B27E2EF7E7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_ApplyAdditive_AD67B36741F083AB4657A8B43F23C217();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_E928CAB74CFB1A29685BB69EAFC7CCB6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_B6ACAF454F0D0663EA2862907EA5AD12();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_107914334FFACF4709D77C874B9F6971();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_SequencePlayer_143B8F474D096656ED7047BDD86E24A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_80574D4144690D120062CC88CADC062F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_D3EE6C7D49A0FF8421097E88EC831D12();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_7132A75F4C69C9D8CF77F2B7EB483F2B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_audi_r8_lms_driver_AnimGraphNode_TransitionResult_4625D70149350F7CF0A87283EDC60FEC();
	void ExecuteUbergraph_ABP_audi_r8_lms_driver(int EntryPoint);
	void DoorClose__DelegateSignature();
	void DoorOpen__DelegateSignature();
	void NetOn__DelegateSignature();
	void NetOff__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
