#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_ABP_mercedes_amg_gt3_driver_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_mercedes_amg_gt3_driver.ABP_mercedes_amg_gt3_driver_C
// 0x2678 (0x2AC8 - 0x0450)
class UABP_mercedes_amg_gt3_driver_C : public UAcDriverAnimations
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0450(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_FE8B30514B08B6434AB20180CE95B21D;      // 0x0458(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0755A2FD4E24324F5C0F15883BE28B46;// 0x04A0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F27016484528BB60E8C95CB32A3499F9;// 0x0550(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DD6111A04C35072FBDCCA18A2DAE40FB;// 0x0668(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17D369D9440FEA27CC69658D3BDE8B97;// 0x0780(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0351AF884DB5990E7038B39248BDD895;// 0x0830(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_227E3A7F45A85A1BBFCF15B1BA908A0E;// 0x0948(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_74B4B8834F6F4D954F0774BF70B4BFCF;// 0x09F8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_171900FF454383A48AF9CFBD473F312D;// 0x0B10(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_64C0D3D544806BA8DD38B092284F8FB3;// 0x0BC0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BFF4EEE54BFF973628CBAB8019D724B4;// 0x0C70(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_17F27C7644CE6ABB158041946629E8D2;// 0x0D88(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_82115CA34B5DAFBF6A2EFF99DFCADF53;// 0x0EA0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0BD2C77C4F261C05F2614CB04BA119A5;// 0x0FB8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0E966D99453FA3B85A99229C7F7FF760;// 0x10D0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3BC836434CC6BA5160E9F29E9EB235F3;// 0x11E8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B0BC7D354510E7F6BBAF3B994BF9FEC0;// 0x1298(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7DE827CB48E8899C6BE9D48FBFCB985A;// 0x1348(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E10DF8BC4D7B2C8E0AAE60BF48D2582E;// 0x13F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A0B070E5499CECE1FB06A9AF33274719;// 0x14A8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_70463828491A8BA3BEC3F3968D561DD7;// 0x1558(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_223DB7F540B18767659EDCAABD3E01CA;// 0x1670(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_89386F964786A423A98A6D96D85D99C5;// 0x1788(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BF412FB1454CC044ADC60E9D3586C158;// 0x18A0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_04D135D74F718C6CA7561BA71CEFC84D;// 0x19B8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E2D1F314E2ED161CC52F3B45F3A71B0;// 0x1AD0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1DA08C714B973457F66DDFA348AC1370;// 0x1B80(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_293566EA4B7294C32F47A29673793D7D;// 0x1C30(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC1A425346D64194A22CB493794EC035;// 0x1CE0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EB40B3D41879B28B6206FB17683102D;// 0x1D90(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_743297CC4357C20D3C22B68D2FD0DA90;// 0x1E40(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_729F3F1B4FC3B45BB4B3059694BA72E5;// 0x1F58(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_60D905F84D806F3477AA77B542B84C98;// 0x2080(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0DEADD774C6CD0517C3A0C8BF6A3E01A;// 0x2198(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F430D09D48A42D2553110CA8B1AFE984;// 0x22C0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43F07E5746C6D1FBDF4E99B18CBD266F;// 0x23D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2FC1C6F04AE746304F6D27915D2B2799;// 0x2488(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C786EBA643D5371381EE8593CDAA7515;// 0x2538(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E17D2F894B6CC0EA67B1FE972E090855;// 0x2650(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B1297DF1415588767E10EEA5ED457D13;// 0x2768(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AF6D06BC4F31225FEBDB56910A4548A7;// 0x27D8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7CBFD14343840021C6FACD842E148098;// 0x2888(0x0118)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_49C00A9646CA39408E95A8AD16C86F7C;// 0x29A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E975635C403831786C9001B7BD69148E;// 0x29E8(0x00E0)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_mercedes_amg_gt3_driver.ABP_mercedes_amg_gt3_driver_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_04D135D74F718C6CA7561BA71CEFC84D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_5E2D1F314E2ED161CC52F3B45F3A71B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_1DA08C714B973457F66DDFA348AC1370();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_293566EA4B7294C32F47A29673793D7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_CC1A425346D64194A22CB493794EC035();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_0EB40B3D41879B28B6206FB17683102D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_743297CC4357C20D3C22B68D2FD0DA90();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_BlendSpacePlayer_729F3F1B4FC3B45BB4B3059694BA72E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_BlendSpacePlayer_0DEADD774C6CD0517C3A0C8BF6A3E01A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_C786EBA643D5371381EE8593CDAA7515();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_E17D2F894B6CC0EA67B1FE972E090855();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequenceEvaluator_B1297DF1415588767E10EEA5ED457D13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_A0B070E5499CECE1FB06A9AF33274719();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_BF412FB1454CC044ADC60E9D3586C158();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_E10DF8BC4D7B2C8E0AAE60BF48D2582E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_7DE827CB48E8899C6BE9D48FBFCB985A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_89386F964786A423A98A6D96D85D99C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_B0BC7D354510E7F6BBAF3B994BF9FEC0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_3BC836434CC6BA5160E9F29E9EB235F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_0E966D99453FA3B85A99229C7F7FF760();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_0BD2C77C4F261C05F2614CB04BA119A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_82115CA34B5DAFBF6A2EFF99DFCADF53();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_17F27C7644CE6ABB158041946629E8D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_BFF4EEE54BFF973628CBAB8019D724B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_64C0D3D544806BA8DD38B092284F8FB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_171900FF454383A48AF9CFBD473F312D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_223DB7F540B18767659EDCAABD3E01CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_74B4B8834F6F4D954F0774BF70B4BFCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_227E3A7F45A85A1BBFCF15B1BA908A0E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_70463828491A8BA3BEC3F3968D561DD7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_0351AF884DB5990E7038B39248BDD895();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_17D369D9440FEA27CC69658D3BDE8B97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_DD6111A04C35072FBDCCA18A2DAE40FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_ApplyAdditive_F27016484528BB60E8C95CB32A3499F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_mercedes_amg_gt3_driver_AnimGraphNode_SequencePlayer_0755A2FD4E24324F5C0F15883BE28B46();
	void ExecuteUbergraph_ABP_mercedes_amg_gt3_driver(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
