#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_ABP_lamborghini_gallardo_rex_driver_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_lamborghini_gallardo_rex_driver.ABP_lamborghini_gallardo_rex_driver_C
// 0x3110 (0x3560 - 0x0450)
class UABP_lamborghini_gallardo_rex_driver_C : public UAcDriverAnimations
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0450(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_D5C3915B423005C0294528ACDCF56825;      // 0x0458(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_06E92E2B44B58C2A214154920DC09C8D;// 0x04A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_400430084F6FB16FC6EFF990558BDC35;// 0x04E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C21632C14B3DF0FBB18BB7AB93C74B8B;// 0x0530(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12BC16424EAB641D814770947E3751DA;// 0x0578(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F15AB5D4827AC61C6D6AC9C152D4271;// 0x05C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D7BE7EAA4645A251E81B57862EC71D01;// 0x0608(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D751C6294F77224BB7ADD79CCE902801;// 0x06B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_803B376A444B99054D6D3E9E9D49A954;// 0x0700(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_019EA25E41B13B93EA953F88BB34A5BC;// 0x07B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E412423C42586A15B10D6ABEE8BF6741;// 0x07F8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_65165C814E38E85F74983C866A33C864;// 0x08A8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_649A91994BD61A0D2C5804833B06D6B8;// 0x08F0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_603A60904C02D865A1618AB385B76E5B;// 0x0A08(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9C3F87914795EEA52080E9B80CA25A49;// 0x0AB8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3471B1040066582E94356974DBC8DF0;// 0x0BD0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E277337F4BC717A51AFA7888BC403534;// 0x0C80(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3740F24F40D4ABD77AD7578F58DC7382;// 0x0D98(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_355A0A4745A69BAA27633FA57970DBE0;// 0x0E48(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3EADB4264F8BE98CDC805099D32CDEBF;// 0x0F60(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1C0A7739410AD48FFE7B5C9509A3D47F;// 0x1010(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C321A2B44E4C1A77CADACAA9D67AC7FC;// 0x1128(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E6D058B048588304EBDDF980B2512499;// 0x1240(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_46633A504810B9BA3801A990CC2CE0D7;// 0x1358(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5558FD5240D40758A1CE8B8F16F8EFCE;// 0x1470(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7859F844C49BF32B36EC3A0747A36DA;// 0x1588(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FFE254334B18847F4824D2A69B5BE34F;// 0x1638(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C696F9AA4AAF62E373140A891DE34944;// 0x1750(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_09232CF542272C7DC3322BB59D0689B2;// 0x1800(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_478CC5C14B9CA3954A58CCBF75C56DCB;// 0x1918(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8B7D35FE42DC6904DE06E0BCFDF7F748;// 0x19C8(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_729CB8FA46AC07AE54F1F0BD01561D1C;// 0x1AE0(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5254D9054C5442F77449519CB42C018C;// 0x1B90(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_65F7C5A94A6E83CA94E2DAA4A4BB0BED;// 0x1CA8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D19C347F4552EA5D4C61408C1E2AFFAF;// 0x1DC0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DFD8678542B4C70EF3E1188272D4509A;// 0x1ED8(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2D6FFEAA4D3F4C59E74D2D828DD5B7E5;// 0x1FF0(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_62F3A83144155C1304ED61B9AFB08942;// 0x2108(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A41FAE6C4309946367EED6BFAC869792;// 0x2220(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_11EB2501464B3B1E957EA5B96D984214;// 0x2338(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E64C2474DCB916BC393728DCB1F1B72;// 0x2450(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_98CB7B494139333E9A1E4FB6A4C9D4F5;// 0x2500(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D9D05D414E07834C9D478D8478B936B6;// 0x25B0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D04D83D644E35D7DB929ABBD50B33CC2;// 0x2660(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8623FA7548F74F6A559BA790BEB870F2;// 0x2710(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91D5E47646047BA670E08688CE0DB92A;// 0x27C0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB056DA242D6F5804263D2AF3E631C4A;// 0x2870(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E06FF4734023657FC2DFAAAAB35F7379;// 0x2920(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F11156C3480F1DCE717A0FB9922F74FE;// 0x29D0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_64A531FB4E0F9C2FEDBABE92BDF8C8EC;// 0x2AF8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_61FC510046ABE03B7EFD609F95548C48;// 0x2C20(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0FE944DD41E4BAFEB31DA9A7D10A7453;// 0x2D48(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8BF984C642FE99089A70D0AB092F90A8;// 0x2E70(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F8F5956B403E871906A656966FAC6956;// 0x2F88(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F68CB022440A01A6E5E748BA49901D36;// 0x30A0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EA19F2054A1345DD0DC0069D77565A27;// 0x3150(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_D90A99584A5C7A14FD4820B50E8332ED;// 0x3200(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC37F8434F87CBB4E13BD8BAB97EF4E8;// 0x3270(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_81E948EC406197CABF940BB311635688;// 0x3320(0x0118)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C7F7EBC84D593973822ACBA8FB60AC40;// 0x3438(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1FAF255E4FEB0F575A493994E7B7D0EC;// 0x3480(0x00E0)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_lamborghini_gallardo_rex_driver.ABP_lamborghini_gallardo_rex_driver_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_729CB8FA46AC07AE54F1F0BD01561D1C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_5254D9054C5442F77449519CB42C018C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_65F7C5A94A6E83CA94E2DAA4A4BB0BED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_D19C347F4552EA5D4C61408C1E2AFFAF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_DFD8678542B4C70EF3E1188272D4509A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_2D6FFEAA4D3F4C59E74D2D828DD5B7E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_62F3A83144155C1304ED61B9AFB08942();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_A41FAE6C4309946367EED6BFAC869792();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_11EB2501464B3B1E957EA5B96D984214();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_4E64C2474DCB916BC393728DCB1F1B72();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_98CB7B494139333E9A1E4FB6A4C9D4F5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_D9D05D414E07834C9D478D8478B936B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_D04D83D644E35D7DB929ABBD50B33CC2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_8623FA7548F74F6A559BA790BEB870F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_91D5E47646047BA670E08688CE0DB92A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_EB056DA242D6F5804263D2AF3E631C4A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_E06FF4734023657FC2DFAAAAB35F7379();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_BlendSpacePlayer_F11156C3480F1DCE717A0FB9922F74FE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_BlendSpacePlayer_64A531FB4E0F9C2FEDBABE92BDF8C8EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_BlendSpacePlayer_61FC510046ABE03B7EFD609F95548C48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_BlendSpacePlayer_0FE944DD41E4BAFEB31DA9A7D10A7453();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_8BF984C642FE99089A70D0AB092F90A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_F8F5956B403E871906A656966FAC6956();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_F68CB022440A01A6E5E748BA49901D36();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_EA19F2054A1345DD0DC0069D77565A27();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequenceEvaluator_D90A99584A5C7A14FD4820B50E8332ED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_C7859F844C49BF32B36EC3A0747A36DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_8B7D35FE42DC6904DE06E0BCFDF7F748();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_5558FD5240D40758A1CE8B8F16F8EFCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_3EADB4264F8BE98CDC805099D32CDEBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_478CC5C14B9CA3954A58CCBF75C56DCB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_355A0A4745A69BAA27633FA57970DBE0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_E277337F4BC717A51AFA7888BC403534();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_F3471B1040066582E94356974DBC8DF0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_9C3F87914795EEA52080E9B80CA25A49();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_603A60904C02D865A1618AB385B76E5B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_649A91994BD61A0D2C5804833B06D6B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_TransitionResult_9F15AB5D4827AC61C6D6AC9C152D4271();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_09232CF542272C7DC3322BB59D0689B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_TransitionResult_12BC16424EAB641D814770947E3751DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_TransitionResult_C21632C14B3DF0FBB18BB7AB93C74B8B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_TransitionResult_400430084F6FB16FC6EFF990558BDC35();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_SequencePlayer_C696F9AA4AAF62E373140A891DE34944();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_TransitionResult_06E92E2B44B58C2A214154920DC09C8D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver_AnimGraphNode_ApplyAdditive_FFE254334B18847F4824D2A69B5BE34F();
	void ExecuteUbergraph_ABP_lamborghini_gallardo_rex_driver(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
