#pragma once

// Assetto Corsa Competizione (0.1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "ACC_AC2_structs.hpp"
#include "ACC_KSRacing_classes.h"
#include <memory>
namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class AC2.AcChildHUD
// 0x0038 (0x0450 - 0x0418)
class AAcChildHUD : public AHUD
{
public:
	class ACarAvatar*                                  Car;                                                      // 0x0418(0x0008) (ZeroConstructor, IsPlainOldData)
	class ACarAvatar*                                  FocusedCar;                                               // 0x0420(0x0008) (ZeroConstructor, IsPlainOldData)
	class ACarAvatar*                                  PlayerCar;                                                // 0x0428(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0430(0x0008) MISSED OFFSET
	class UFont*                                       HUDFont;                                                  // 0x0438(0x0008) (ZeroConstructor, IsPlainOldData)
	class UFont*                                       HUDFontBold;                                              // 0x0440(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0448(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcChildHUD");
		return ptr;
	}

};


// Class AC2.Ac2TelemHUD
// 0x00C0 (0x0510 - 0x0450)
class AAc2TelemHUD : public AAcChildHUD
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0450(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.Ac2TelemHUD");
		return ptr;
	}

};


// Class AC2.AC2TyreSmoke
// 0x0090 (0x0840 - 0x07B0)
class UAC2TyreSmoke : public UParticleSystemComponent
{
public:
	TArray<class UParticleSystemComponent*>            Smoke;                                                    // 0x07B0(0x0010) (Edit, ExportObject, ZeroConstructor, EditConst)
	TArray<class UParticleSystemComponent*>            dirt;                                                     // 0x07C0(0x0010) (Edit, ExportObject, ZeroConstructor, EditConst)
	TArray<class UParticleSystemComponent*>            stone;                                                    // 0x07D0(0x0010) (Edit, ExportObject, ZeroConstructor, EditConst)
	class UCurveFloat*                                 rate1Curve;                                               // 0x07E0(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	class UCurveFloat*                                 rate2Curve;                                               // 0x07E8(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	class UCurveFloat*                                 smokeRateCurve;                                           // 0x07F0(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	class UCurveFloat*                                 stonesRateCurve;                                          // 0x07F8(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	class UCurveFloat*                                 smokeBuildCurve;                                          // 0x0800(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	class UCurveFloat*                                 smokeCoolCurve;                                           // 0x0808(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0810(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AC2TyreSmoke");
		return ptr;
	}

};


// Class AC2.AC2WaterSpray
// 0x00E0 (0x0890 - 0x07B0)
class UAC2WaterSpray : public UParticleSystemComponent
{
public:
	class UParticleSystemComponent*                    waterSprayDrops[0x2];                                     // 0x07B0(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UParticleSystemComponent*                    backSpray;                                                // 0x07C0(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UParticleSystemComponent*                    waterSprayDetail[0x4];                                    // 0x07C8(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UParticleSystemComponent*                    waterSprayFog;                                            // 0x07E8(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCurveFloat*                                 WaterCurve;                                               // 0x07F0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 FogSpeedRateCurve;                                        // 0x07F8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 DetailsSpeedRateCurve;                                    // 0x0800(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                DetailsSpeedVelMinCurve;                                  // 0x0808(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                DetailsSpeedVelMaxCurve;                                  // 0x0810(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 DropsSpeedRateCurve;                                      // 0x0818(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 ChaseSpeedRateCurve;                                      // 0x0820(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseFocusedVelMinCurve;                               // 0x0828(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseFocusedVelMaxCurve;                               // 0x0830(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseFocusedAlphaLifeCurve;                            // 0x0838(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseNotFocusedRateCurve;                              // 0x0840(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseNotFocusedVelMinCurve;                            // 0x0848(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseNotFocusedVelMaxCurve;                            // 0x0850(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 fogChaseNotFocusedAlphaLifeCurve;                         // 0x0858(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0860(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AC2WaterSpray");
		return ptr;
	}

};


// Class AC2.AcAnimInstanceBase
// 0x0010 (0x0370 - 0x0360)
class UAcAnimInstanceBase : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0360(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcAnimInstanceBase");
		return ptr;
	}

};


// Class AC2.AcAnimNotify
// 0x0008 (0x0040 - 0x0038)
class UAcAnimNotify : public UAnimNotify
{
public:
	ECarAnimation                                      CarAnimation;                                             // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcAnimNotify");
		return ptr;
	}

};


// Class AC2.AcAssistController
// 0x0038 (0x0060 - 0x0028)
class UAcAssistController : public UObject
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0028(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcAssistController");
		return ptr;
	}

};


// Class AC2.AcCameraComponent
// 0x0070 (0x0850 - 0x07E0)
class UAcCameraComponent : public UCameraComponent
{
public:
	float                                              ShadowExponent;                                           // 0x07E0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6C];                                      // 0x07E4(0x006C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCameraComponent");
		return ptr;
	}

};


// Class AC2.AcCameraTranslator
// 0x0000 (0x0028 - 0x0028)
class UAcCameraTranslator : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCameraTranslator");
		return ptr;
	}

};


// Class AC2.AcCarAnimations
// 0x00F0 (0x01E0 - 0x00F0)
class UAcCarAnimations : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnCarAnimationEvent;                                      // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class ACarAvatar*                                  CarAvatar;                                                // 0x0100(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LeftFootFrameStep;                                        // 0x0108(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RightFootFrameStep;                                       // 0x010C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HalfSteerAnimationSeconds;                                // 0x0110(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaximumSteerAnimationRotation;                            // 0x0114(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HelmetGForceFilter;                                       // 0x0118(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HelmetGForceXMaxRange;                                    // 0x011C(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   HelmetGForceYMaxRange;                                    // 0x0124(0x0008) (Edit, DisableEditOnInstance, IsPlainOldData)
	float                                              FeetFilter;                                               // 0x012C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RightFootPositionForAnimation;                            // 0x0130(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   LeftFootPositionForAnimation;                             // 0x0134(0x0008) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	float                                              DriverSteerRotation;                                      // 0x013C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HelmetGForceForAnimation;                                 // 0x0140(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               ShiftUpForAnimation;                                      // 0x014C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ShiftDownForAnimation;                                    // 0x014D(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x014E(0x0002) MISSED OFFSET
	float                                              LeftDoorOpenRate;                                         // 0x0150(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RightDoorOpenRate;                                        // 0x0154(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FVector2D>                           WiperIntervalsAndRate;                                    // 0x0158(0x0010) (Edit, ZeroConstructor)
	float                                              CarSteerRotation;                                         // 0x0168(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ClutchPedalPosition;                                      // 0x016C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              BrakePedalPosition;                                       // 0x0170(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              GasPedalPosition;                                         // 0x0174(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FCarLoosePart>                       CarLooseParts;                                            // 0x0178(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FCarWiper>                           Wipers;                                                   // 0x0188(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x48];                                      // 0x0198(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarAnimations");
		return ptr;
	}


	unsigned char GetWipersMaxLevel();
	unsigned char GetWipersCount();
	float GetWiperPosition(unsigned char WiperIndex);
	float GetRightDoorOpenRate();
	float GetNormalizedWiperPosition(unsigned char WiperIndex);
	float GetLeftDoorOpenRate();
	struct FVector GetCarLoosePartPosition(unsigned char LoosePartIndex);
};


// Class AC2.AcCarBeltAnimations
// 0x0000 (0x0370 - 0x0370)
class UAcCarBeltAnimations : public UAcAnimInstanceBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarBeltAnimations");
		return ptr;
	}

};


// Class AC2.AcCarDigitalDisplay
// 0x01A8 (0x03B0 - 0x0208)
class UAcCarDigitalDisplay : public UUserWidget
{
public:
	TArray<struct FCarDigitalDisplayPage>              Pages;                                                    // 0x0208(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bIsDashboardDisplay;                                      // 0x0218(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
	class ACarAvatar*                                  CarAvatar;                                                // 0x0220(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AAcRaceGameMode*                             RaceGameMode;                                             // 0x0228(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      DisplayIndex;                                             // 0x0230(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0231(0x0007) MISSED OFFSET
	TArray<struct FCarDigitalDisplayTimeTextBlock>     TimeTextBlocks;                                           // 0x0238(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FCarDigitalDisplayNumberTextBlock>   NumberTextBlocks;                                         // 0x0248(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FCarDigitalDisplayProgressBar>       ProgressBars;                                             // 0x0258(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FCarDigitalDisplayCanvas>            PopUps;                                                   // 0x0268(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FCarDigitalDisplayNeedle>            Needles;                                                  // 0x0278(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FCarDigitalDisplayLight>             lights;                                                   // 0x0288(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)
	unsigned char                                      UnknownData02[0x118];                                     // 0x0298(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarDigitalDisplay");
		return ptr;
	}


	void OnLapEvent();
};


// Class AC2.AcCarExteriorAnimations
// 0x0040 (0x03B0 - 0x0370)
class UAcCarExteriorAnimations : public UAcAnimInstanceBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0370(0x0008) MISSED OFFSET
	float                                              CarLeftDoor;                                              // 0x0378(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CarRightDoor;                                             // 0x037C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FTransform>                          Wheels;                                                   // 0x0380(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FTransform>                          Suspensions;                                              // 0x0390(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	bool                                               bIsPhysicsDriven;                                         // 0x03A0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x03A1(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarExteriorAnimations");
		return ptr;
	}

};


// Class AC2.AcCarGraphicData
// 0x0170 (0x01A0 - 0x0030)
class UAcCarGraphicData : public UDataAsset
{
public:
	class UTexture2D*                                  NumberSet;                                                // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  SkinTemplates;                                            // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  RimTemplates;                                             // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  AuxLightMeshes;                                           // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  NumberPanelMeshes;                                        // 0x0050(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  StickerSets;                                              // 0x0058(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  ColorTable;                                               // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  HelmetTemplates;                                          // 0x0068(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  GlovesTemplates;                                          // 0x0070(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  SuitTemplates;                                            // 0x0078(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  TeamTemplates;                                            // 0x0080(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UMaterialInstance*                           NumberPlate_Pro;                                          // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           NumberPlate_ProAm;                                        // 0x0090(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           NumberPlate_Am;                                           // 0x0098(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           NumberPlate_Silver;                                       // 0x00A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DecalNumberPlate_Pro;                                     // 0x00A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DecalNumberPlate_ProAm;                                   // 0x00B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DecalNumberPlate_Am;                                      // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DecalNumberPlate_Silver;                                  // 0x00C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           RaceClass_Pro;                                            // 0x00C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           RaceClass_ProAm;                                          // 0x00D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           RaceClass_Am;                                             // 0x00D8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           RaceClass_Silver;                                         // 0x00E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     NumberPlate_Scale;                                        // 0x00E8(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     RaceClass_ProScale;                                       // 0x00F4(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     RaceClass_ProAmScale;                                     // 0x0100(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     RaceClass_AmScale;                                        // 0x010C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     RaceClass_SilverScale;                                    // 0x0118(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0124(0x0004) MISSED OFFSET
	struct FSkinMaterialType                           SkinMaterialSolid;                                        // 0x0128(0x0018) (Edit, BlueprintVisible)
	struct FSkinMaterialType                           SkinMaterialMatte;                                        // 0x0140(0x0018) (Edit, BlueprintVisible)
	struct FSkinMaterialType                           SkinMaterialSatin;                                        // 0x0158(0x0018) (Edit, BlueprintVisible)
	struct FSkinMaterialType                           SkinMaterialMetallic;                                     // 0x0170(0x0018) (Edit, BlueprintVisible)
	struct FSkinMaterialType                           SkinMaterialChrome;                                       // 0x0188(0x0018) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarGraphicData");
		return ptr;
	}


	bool GetTeam(const struct FName& RowName, struct FTeamTemplate* Destination);
	bool GetSuitTable(const struct FName& RowName, struct FDriverSuitTemplate* Destination);
	bool GetStickerSet(const struct FName& RowName, struct FStickerSet* Destination);
	bool GetSkinTemplate(const struct FName& RowName, struct FSkinTemplate* Destination);
	bool GetRimTemplate(const struct FName& RowName, struct FRimTemplate* Destination);
	bool GetNumberPanelMesh(const struct FName& RowName, struct FNumberPanelMesh* Destination);
	bool GetHelmetTable(const struct FName& RowName, struct FDriverHelmetTemplate* Destination);
	bool GetGlovesTable(const struct FName& RowName, struct FDriverGlovesTemplate* Destination);
	bool GetColorTable(const struct FName& RowName, struct FSkinColor* Destination);
	bool GetAuxLightMesh(const struct FName& RowName, struct FAuxLightMesh* Destination);
};


// Class AC2.AcCarInteriorAnimations
// 0x0040 (0x03B0 - 0x0370)
class UAcCarInteriorAnimations : public UAcAnimInstanceBase
{
public:
	float                                              GasPressure;                                              // 0x0370(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              BrakePressure;                                            // 0x0374(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ClutchPressure;                                           // 0x0378(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SteerRotation;                                            // 0x037C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FlipPosition;                                             // 0x0380(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              IgnitionPosition;                                         // 0x0384(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PowerPosition;                                            // 0x0388(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RainPosition;                                             // 0x038C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LightPosition;                                            // 0x0390(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0394(0x0004) MISSED OFFSET
	TArray<struct FSwitchAnimation>                    Switches;                                                 // 0x0398(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x03A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarInteriorAnimations");
		return ptr;
	}


	void UpdateAnimation(int Index);
	void OnNotifyReceived(float TimeDelay, int Index);
	void OnCarAnimationEvent(ECarAnimation CarAnimation);
	struct FRotator GetCurrentSwitchRotator(unsigned char Index);
};


// Class AC2.AcCarLightingSystem
// 0x03F8 (0x04E8 - 0x00F0)
class UAcCarLightingSystem : public UActorComponent
{
public:
	struct FCarLightStage                              SprintDayLights;                                          // 0x00F0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintHighBeam;                                           // 0x0100(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintBrakes;                                             // 0x0110(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintEndurance;                                          // 0x0120(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintFlashing;                                           // 0x0130(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintPitLimiter;                                         // 0x0140(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintRain;                                               // 0x0150(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintDirectionLightLeft;                                 // 0x0160(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              SprintDirectionLightRight;                                // 0x0170(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceDayLights;                                       // 0x0180(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceHighBeam;                                        // 0x0190(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceBrakes;                                          // 0x01A0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceEndurance;                                       // 0x01B0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceFlashing;                                        // 0x01C0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EndurancePitLimiter;                                      // 0x01D0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceRain;                                            // 0x01E0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceDirectionLightLeft;                              // 0x01F0(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              EnduranceDirectionLightRight;                             // 0x0200(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              DayLights;                                                // 0x0210(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              HighBeam;                                                 // 0x0220(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              Brakes;                                                   // 0x0230(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              Endurance;                                                // 0x0240(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              Flashing;                                                 // 0x0250(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              PitLimiter;                                               // 0x0260(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              Rain;                                                     // 0x0270(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              DirectionLightLeft;                                       // 0x0280(0x0010) (Edit, DisableEditOnInstance)
	struct FCarLightStage                              DirectionLightRight;                                      // 0x0290(0x0010) (Edit, DisableEditOnInstance)
	struct FName                                       FrontMaterialSlotName;                                    // 0x02A0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       RearMaterialSlotName;                                     // 0x02A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       FrontGlassMaterialSlotName;                               // 0x02B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       RearGlassMaterialSlotName;                                // 0x02B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DamageLeft;                                               // 0x02C0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DamageRight;                                              // 0x02C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      MaxFlashingCount;                                         // 0x02C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02C9(0x0003) MISSED OFFSET
	float                                              IntAuxLightMaterialEmissive;                              // 0x02CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              IntAuxLightIntensity;                                     // 0x02D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02D4(0x0004) MISSED OFFSET
	class UMaterialInstanceDynamic*                    FrontMaterial;                                            // 0x02D8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    RearMaterial;                                             // 0x02E0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    FrontGlassMaterial;                                       // 0x02E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    RearGlassMaterial;                                        // 0x02F0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    intAuxLightMaterial;                                      // 0x02F8(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1E8];                                     // 0x0300(0x01E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarLightingSystem");
		return ptr;
	}

};


// Class AC2.AcCarLocationManager
// 0x0050 (0x0378 - 0x0328)
class AAcCarLocationManager : public AActor
{
public:
	class ATriggerBox*                                 PitEntryLaneSideStart;                                    // 0x0328(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerVolume*                              PitEntryLaneSide;                                         // 0x0330(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerBox*                                 PitLaneEntry;                                             // 0x0338(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerBox*                                 PitLaneExit;                                              // 0x0340(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerVolume*                              PitExitLaneSide;                                          // 0x0348(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerBox*                                 PitExitLaneEnd;                                           // 0x0350(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerBox*                                 SafetyCarLine1;                                           // 0x0358(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class ATriggerBox*                                 SafetyCarLine2;                                           // 0x0360(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0368(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarLocationManager");
		return ptr;
	}


	void OnSafetyCarLine2(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnSafetyCarLine1(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPitLaneExit(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPitLaneEntry(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPitExitLaneSide(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPitExitLaneEnd(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPitEntryLaneStart(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPitEntryLaneSide(class AActor* OverlappedActor, class AActor* OtherActor);
	class AAcCarLocationManager* STATIC_FindCarLocationManager(class UWorld* World);
};


// Class AC2.AcCarLoosePartAnimations
// 0x0010 (0x0380 - 0x0370)
class UAcCarLoosePartAnimations : public UAcAnimInstanceBase
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0370(0x0004) MISSED OFFSET
	ELoosePartType                                     LoosePartType;                                            // 0x0374(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xB];                                       // 0x0375(0x000B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarLoosePartAnimations");
		return ptr;
	}

};


// Class AC2.AcCarPitstopManager
// 0x0170 (0x0260 - 0x00F0)
class UAcCarPitstopManager : public UActorComponent
{
public:
	float                                              MinDistance;                                              // 0x00F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistance;                                              // 0x00F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SecondaryDistance;                                        // 0x00F8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxAngle;                                                 // 0x00FC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PushingSpeed;                                             // 0x0100(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PushingAngularSpeed;                                      // 0x0104(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OnSkateSpeed;                                             // 0x0108(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OnSkateAngularSpeed;                                      // 0x010C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FakePitstopTime;                                          // 0x0110(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SecondsToExtend;                                          // 0x0114(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SecondsToBaseStartProcedure;                              // 0x0118(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SecondsToRaiseProcedure;                                  // 0x011C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              targetHeight;                                             // 0x0120(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x13C];                                     // 0x0124(0x013C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarPitstopManager");
		return ptr;
	}


	void SetPitZone_BP(int _mainIndex, int _secondaryIndex);
	void SetOutside(EPitstopCarOutside Value);
	void RequestPitstop_BP();
};


// Class AC2.AcCarProtectionNetAnimations
// 0x0020 (0x0390 - 0x0370)
class UAcCarProtectionNetAnimations : public UAcAnimInstanceBase
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0370(0x0004) MISSED OFFSET
	bool                                               bIsCarRunning;                                            // 0x0374(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDetachNet;                                               // 0x0375(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAttachNet;                                               // 0x0376(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0377(0x0001) MISSED OFFSET
	float                                              DetachSpeed;                                              // 0x0378(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AttachSpeed;                                              // 0x037C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0380(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarProtectionNetAnimations");
		return ptr;
	}

};


// Class AC2.AcCarSystems
// 0x0020 (0x0048 - 0x0028)
class UAcCarSystems : public UObject
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0028(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarSystems");
		return ptr;
	}


	void ToggleRightDoor();
	void ToggleLeftDoor();
	void SetWiperLevel(unsigned char Level, bool updateSystems);
	unsigned char GetWiperLevel();
	ECarLightStage GetLightStage();
	void EnableDriverDoor(bool isOpening);
	void CycleWiperLevel(bool isUp);
};


class UAcGameInstance;
class AGhostCarManager;
// Class AC2.AcCarTimingServices
// 0x01E8 (0x0210 - 0x0028)
class UAcCarTimingServices : public UObject
{
public:
	char CurrentSector;
	unsigned char padding[0x18];
	ACarAvatar *CarAvatar;
	AAcRaceGameMode *raceGameMode;
	ksRacing::RaceManager *raceManager;
	UAcGameInstance *GameInstance;
	char SectorCount;
	float fastLaneUnlockTime;
	bool bIsSplitCrossingValid;
	float LastSplitTimeStamp;
	float CurrentLapTime;
	int LaptimesSum;
	uint16_t LapCount;
	ksRacing::Lap BestLap;
	ksRacing::Lap LastLap;
	int lapTimeDiff;
	float speedDiff;
	int predictedLapTime;
	FLapTimeReference bestLapReference;
	std::vector<unsigned int, std::allocator<unsigned int> > deltaTimeBestLap;
	std::vector<unsigned int, std::allocator<unsigned int> > deltaTimeCurrentLap;
	std::vector<float, std::allocator<float> > deltaSpeedBestLap;
	std::vector<float, std::allocator<float> > deltaSpeedCurrentLap;
	uint16_t deltaSectorIndex;
	int lastDeltaIndex;
	float deltaStep;
	TArray<int> speedAvgs;
	bool mustRecordSpeed;
	float relativeSpeed;
	bool updateRelativeSpeed;
	bool useTrackMicroSectorTimes;
	float startingFuelOnLastLap;
	float totalFuelUsedInSession;
	float fuelPerSingleLap;
	float fuelPerKm;
	bool isCarOutOfTrack;
	int onCarOutOfTrackTimeStart;
	int onCarOutOfTrackTimeEnd;
	int onCarOutOfTrackSectorStart;
	int onCarOutOfTrackSectorEnd;
	int onCarOutOfTrackTimeJoin;
	int outOfTrackRealDeltaTime;
	AGhostCarManager *ghostCarManager;
	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcCarTimingServices");
		return ptr;
	}


	void Reset();
	void OnSplit_BP(int SectorId, float PhysicsTime);
	int GetSpeedDiff();
	int GetPredictedLapTime();
	int GetLastLapTime();
	int GetLapTimeDiff();
	int GetLapCount();
	int GetCurrentLapTime();
	struct FLapTimeReference GetBestLapTime();
};


// Class AC2.AcController
// 0x0080 (0x06F8 - 0x0678)
class AAcController : public APlayerController
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0678(0x0018) MISSED OFFSET
	float                                              ForwardSpeed;                                             // 0x0690(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LateralSpeed;                                             // 0x0694(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VerticalSpeed;                                            // 0x0698(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              YawSpeed;                                                 // 0x069C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PitchSpeed;                                               // 0x06A0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RollSpeed;                                                // 0x06A4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CameraSmoothness;                                         // 0x06A8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CameraSpeed;                                              // 0x06AC(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseGamepadForFreeCamera;                                 // 0x06B0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x06B1(0x0003) MISSED OFFSET
	struct FVector                                     ParticlesOffset;                                          // 0x06B4(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData02[0x38];                                      // 0x06C0(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcController");
		return ptr;
	}


	void SetCameraOnCar(class ACarAvatar* Car);
};


// Class AC2.AcControllerIcon
// 0x0008 (0x01E0 - 0x01D8)
class UAcControllerIcon : public UImage
{
public:
	EControllerActionType                              UIActionType;                                             // 0x01D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsRacePage;                                              // 0x01D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x01DA(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class AC2.AcControllerIcon");
		return ptr;
	}

};


// Class AC2.AcDriverAnimations
// 0x00E0 (0x0450 - 0x0370)
class UAcDriverAnimations : public UAcAnimInstanceBase
{
public:
	float                                              ClutchBrakePressure;                                      // 0x0370(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClutchBrakeSwitch;                                        // 0x0374(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LookLeftRight;                                            // 0x0378(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GForceOnX;                                                // 0x037C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GForceOnY;                                                // 0x0380(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bSkipAnimations;                                          // 0x0384(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsDriving;                                               // 0x0385(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsOnMarker;                                              // 0x0386(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bGearUp;                                                  // 0x0387(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GearUpAlpha;                                              // 0x0388(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bGearDown;                                                // 0x038C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x038D(0x0003) MISSED OFFSET
	float                                              GearDownAlpha;                                            // 0x0390(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bWiper;                                                   // 0x0394(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0395(0x0003) MISSED OFFSET
	float                                              WiperAlpha;                                               // 0x0398(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bLights;                                                  // 0x039C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x039D(0x0003) MISSED OFFSET
	float                                              LightsAlpha;                                              // 0x03A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDisplay;                                                 // 0x03A4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x03A5(0x0003) MISSED OFFSET
	float                                              DisplayAlpha;                                             // 0x03A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bFlashingLights;                                          // 0x03AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x03AD(0x0003) MISSED OFFSET
	float                                              FlashingLightsAlpha;                                      // 0x03B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bPitLimiter;                                              // 0x03B4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x03B5(0x0003) MISSED OFFSET
	float                                              PitLimiterAlpha;                                          // 0x03B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRadio;                                                   // 0x03BC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x03BD(0x0003) MISSED OFFSET
	float                                              RadioAlpha;                                               // 0x03C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTC;                                                      // 0x03C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x03C5(0x0003) MISSED OFFSET
	float                                              TCAlpha;                                                  // 0x03C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bABS;                                                     // 0x03CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x03CD(0x0003) MISSED OFFSET
	float                                              ABSAlpha;                                                 // 0x03D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bBrakeBias;                                               // 0x03D4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x03D5(0x0003) MISSED OFFSET
	float                                              BrakeBiasAlpha;                                           // 0x03D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRainLight;                                               // 0x03DC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x03DD(0x0003) MISSED OFFSET
	float                                              RainLightAlpha;                                           // 0x03E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnitionSequenceOn;                                      // 0x03E4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x03E5(0x0003) MISSED OFFSET
	float                                              IgnitionSequenceOnAlpha;                                  // 0x03E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bEngineMap;                                               // 0x03EC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x3];                                       // 0x03ED(0x0003) MISSED OFFSET
	float                                              EngineMapAlpha;                                           // 0x03F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDirectionLightLeft;                                      // 0x03F4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x03F5(0x0003) MISSED OFFSET
